#!/bin/bash
#
#   并行执行
#   
#   搜索自己指定的ip，子网掩码为24的网段，up的ip地址
#
#   请输入一个IP地址例192.168.37.234，
#   如果格式不是0.0.0.0 则报错退出；
#   正确则进入循环，IP变量的值为192.168.37.  
#   i的范围为1-254，并行ping 192.168.37.1-154，
#   ping通就输出此IP为UP。直到循环结束。
read -p "Please input network (eg:192.168.0.0): " net
echo $net | egrep -o "\<(([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.){3}([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\>"

[ $? -eq 0 ] || ( echo "input error"; exit 10 )

IP=`echo $net | egrep -o "^([0-9]{1,3}\.){3}"`

for i in {1..254}; do
    {
        ping -c 1 -w 1 $IP$i &> /dev/null && \
        echo "$IP$i is up"
    }&
done
wait